ScanMarkerSDK/ScanMarkerSDK/Models/SOAP/run_ocr_v3.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
    <soap12:Body>
        <RunOCR_V3 xmlns="http://cloud.a.scanmarker.com/">
            <bmpFileBytesBase64>%@</bmpFileBytesBase64>
            <isCompressed>true</isCompressed>
            <languageId>%d</languageId>
            <Token>%@</Token>
            <isRtoL>%@</isRtoL>
            <isVertical>%@</isVertical>
            <isTableMode>false</isTableMode>
            <compressionVersion>%d</compressionVersion>
            <ocrEngine>%d</ocrEngine>
        </RunOCR_V3>
    </soap12:Body>
</soap12:Envelope>
